<?php

// +----------------------------------------------------------------------
// | 骑士发卡 [ 平顶山若拉网络科技有限公司，并保留所有权利 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2020 https://www.qqss.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 骑士软件 并不是自由软件，商业用途务必到官方购买正版授权, 以免引起不必要的法律纠纷.
// +----------------------------------------------------------------------
// | Author: QQSS <admin@qqss.net>
// +----------------------------------------------------------------------

namespace app\service\notify;

use app\common\model\User as UserModel;

class SigninNotifyService
{
    public function notify($user)
    {
        $user    = UserModel::where('id', $user['id'])->find();
        $title   = "您好，您的帐号 " . $user['username'] . "登录成功";
        $content = "如果本次登录不是您本人所为，说明您的帐号已经被盗！为减少您的损失，请进入会员中心修改密码。";

        // todo 登录邮件通知
    }
}
