<?php

// +----------------------------------------------------------------------
// | 骑士虚拟产品寄售商城系统开源版 
// +----------------------------------------------------------------------
// | Copyright (c) 2023-2025 https://www.qqss.net All rights reserved.
// +----------------------------------------------------------------------
// | Licensed MIT 本系统开源仅仅是为了新手学习开发商城为目的，使用时请遵循当地法律法规
// +----------------------------------------------------------------------
// | Author: QQSS <990504246@qq.com>
// +----------------------------------------------------------------------

namespace app\service\notify;

use app\common\model\User as UserModel;

class SigninNotifyService
{
    public function notify($user)
    {
        $user    = UserModel::where('id', $user['id'])->find();
        $title   = "您好，您的帐号 " . $user['username'] . "登录成功";
        $content = "如果本次登录不是您本人所为，说明您的帐号已经被盗！为减少您的损失，请进入会员中心修改密码。";

        // todo 登录邮件通知
    }
}
